*NAME      : RAJPRIYA R*




**TITANIC SURVIVORS ANALYSIS- PROJECT**

In [2]:
import numpy as np
import pandas as pd

READING DATA USING PANDAS

We shall use *read_csv* function to read python and pandas *Dataframe* for converting a file into the *Dataframe*

In [3]:
df = pd.DataFrame(pd.read_csv('/content/dataset/train (1).csv'))
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [4]:
df.shape

#df.shape[0] = 891
#df.shape[1] = 12

(891, 12)

NULL VALUES

Dataset may or may not consists of values (i.e)some values may be missed in the dataset and it can be handled using two cases:


1.Droping entire row or column

2.Filling appropriate values to the missed values.

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

PRINTING THE COLUMNS WHICH HAS MORE THAN 40% MISSING VALUES IN THE DATASET

In [6]:
#printing the columns which has more than 40% missing values
x = df.isnull().sum()

drop_column = x[x>(40/100 * df.shape[0])]
drop_column

Cabin    687
dtype: int64

In [7]:
drop_column.index

Index(['Cabin'], dtype='object')

In [8]:
df.drop(drop_column.index, inplace=True, axis=1)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

FILLING MISSING VALUES WITH NULL OR MEAN VALUES

In [9]:
#filling missing values with mean value

df.fillna(df.mean(), inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

DESCRIBING A PARTICULAR COLUMN

In [10]:
#describing Embarked column

df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [11]:
#describing Age column

df['Age'].describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

MAKING *Embarked* COLUMN WITHOUT ANY MISSED VALUES

In [12]:
#making Embarked column missing values to be filled with 'S' as it occurs at maximum range

df['Embarked'].fillna('S', inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

DESCRIBING CORELATION IN THE DATASER BETWEEN THE COLUMNS

In [13]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

COMBINING COLUMNS TO AN ANOTHER COLUMN



Column description:

sibsp- no.of siblings/spouses abroad

parch- no.of parent/children abroad

In [14]:
#combining columns Sibsp and Parch to a column Family

df['Family'] = df['SibSp'] + df['Parch']
df.drop(['SibSp', 'Parch'], axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare    Family
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500  0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566 -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000  0.217138
Family         -0.040143  0.016639  0.065997 -0.248512  0.217138  1.000000

In [15]:
#family in the ship does not have much correlance with survival rate

CHECKING WHETHER THE PERSON WHO WAS ALONE CAN AFFECT THE SURVIVAL RATE OR NOT

In [16]:
df['Alone'] = [0 if df['Family'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked Family  Alone
0            1         0       3  ...        S      1      0
1            2         1       1  ...        C      1      0
2            3         1       3  ...        S      0      1
3            4         1       1  ...        S      1      0
4            5         0       3  ...        S      0      1

[5 rows x 11 columns]

FINDING THE PERSON WHO IS ALONE HAS THE CHANCE TO SURVIVE OR NOT

In [17]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

By this we conclude that the person who is alone has very less chance of surviving

REASON: As the person is alone who is not probably belongs to rich class and the people who belongs to rich class has been prioritized.

In [18]:
df.groupby(['Alone'])['Fare'].mean()

Alone
0    48.832275
1    21.242689
Name: Fare, dtype: float64

So, the person who was not alone would have to pay higher ticket price

In [19]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

By this we can say that female passsengers have more chance of surviving than the male passengers

In [20]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

In [21]:
df.groupby(['Age'])['Survived'].mean()

Age
0.42     1.0
0.67     1.0
0.75     1.0
0.83     1.0
0.92     1.0
        ...
70.00    0.0
70.50    0.0
71.00    0.0
74.00    0.0
80.00    1.0
Name: Survived, Length: 89, dtype: float64

CONCLUSION:

1. People with family has been prioritized than alone for survival

2. Female passengers have more chance of surviving than the male ones

3. People who belongs to high class are supposed to have more chance of surviving than others

4. People who borded the ship at Cherbourg, survived more in proportion than the others.